tutorials/floatRigidBody/trial_cases/floatRigidBody_partioned_nOuter8/0.orig/beamone/Theta
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "2";
    object      Theta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<vector> 
40
(
(4.12908660651e-12 0.0478326407478 -6.00862956176e-12)
(4.11058298256e-12 0.0471394887701 -5.97942036892e-12)
(4.07418644947e-12 0.0459102768369 -5.9220737763e-12)
(4.01787441429e-12 0.044267140762 -5.83335100565e-12)
(3.93959650193e-12 0.0423050194763 -5.70995359806e-12)
(3.83773514676e-12 0.0400976974053 -5.54925556652e-12)
(3.71133208602e-12 0.0377025087739 -5.34966586962e-12)
(3.56015758491e-12 0.0351639994977 -5.11074234799e-12)
...
)
;

boundaryField
{
    left
    {
        type            momentBeamRotationNR;
        value           uniform (4.12908660651e-12 0.0478326407478 -6.00862956176e-12);
        momentSeries    
{
        file            "$FOAM_CASE/constant/beamone/timeVsMoment";
        outOfBounds     clamp;
}
        moment          uniform (0 0 0);
    }
    right
    {
        type            momentBeamRotationNR;
        value           uniform (-3.50643364865e-12 -0.0465641082632 6.2056215434e-12);
        momentSeries    
{
        file            "$FOAM_CASE/constant/beamone/timeVsMoment";
        outOfBounds     clamp;
}
        moment          uniform (0 0 0);
    }
    beam
    {
        type            empty;
    }
}


// ************************************************************************* //
